/*
 * Стъпката при търсене на начално допустимо решение
 * и при търсене на Чебишевия център.
 */
param improveStep := 1;

/*
 * За началната популация се генерират случайни числа
 * в интервала xi +/- popDeltaCoef * (xi_upper - xi_lower)
 */
param popDeltaCoef := 0.05;

/*
 *  Размер на началната популация
 */
param popSize := 10;

/*
 * Размер на външната популация като процент 
 * от вътрешната (началната)
 */
param popSizeExtCoef := 0.2;

var x1 integer >= 0 <= 1000;
var x2 integer >= 0 <= 100;

/* Критерии */
minimize f1: 1/(x1 + 1);
minimize f2: 1/(x2 + 1);

c1: x1^2 + 100*x2^2 <= 10^6;