param improveStep := 1;
param popSize := 10;
param popDeltaCoef := 0.05;
param popSizeExtCoef := 0.2;

param M := 3;
param N := 4;


// КАРДНИ ПАМУЧНИ ПРЕЖДИ
var X01 >= 250.5 <= 10^M;
var X02 >=   0.0 <= 10^M;
var X03 >=  20.0 <= 10^M;
var X04 >=  15.9 <= 10^M;
var X05 >= 200.4 <= 10^M;
var X06 >=  50.5 <= 10^M;
var X07 >=  23.5 <= 10^M;
var X08 >=  65.5 <= 10^M;
var X09 >=  47.0 <= 10^M;
var X10 >=   0.0 <= 10^M;


// ПЕНИРАНИ ПАМУЧНИ ПРЕЖДИ
var X11 >=  0.0 <= 10^M;
var X12 >=  0.0 <= 10^M;
var X13 >=  0.0 <= 10^M;
var X14 >=  0.0 <= 10^M;
var X15 >=  0.0 <= 10^M;
var X16 >= 65.0 <= 10^M;
var X17 >= 50.2 <= 10^M;
var X18 >= 15.4 <= 10^M;
var X19 >=  0.5 <= 10^M;
var X20 >= 16.7 <= 10^M;


// ПРЕЖДИ СМЕС (ПАМУК И ПОЛИЕСТЕР)
var X21 >=  80.6 <= 10^M;
var X22 >= 160.0 <= 10^M;
var X23 >=   8.9 <= 10^M;
var X24 >=   0.0 <= 10^M;
var X25 >=   0.0 <= 10^M;
var X26 >=   0.0 <= 10^M;
var X27 >=   0.0 <= 10^M;
var X28 >=   0.0 <= 10^M;
var X29 >=   0.0 <= 10^M;
var X30 >=   0.0 <= 10^M;
var X31 >= 100.4 <= 10^M;
var X32 >=  22.2 <= 10^M;
var X33 >= 120.5 <= 10^M;
var X34 >= 250.5 <= 10^M;
var X35 >=   0.0 <= 10^M;
var X36 >=   0.0 <= 10^M;
var X37 >= 300.5 <= 10^M;
var X38 >= 150.0 <= 10^M;
var X39 >=   0.0 <= 10^M;
var X40 >=  65.1 <= 10^M;
var X41 >=  40.2 <= 10^M;


// КАРДНИ ПАМУЧНИ ПРЕЖДИ ЗА РЕАЛИЗАЦИЯ
var Y01 >=   0.0 <= 10^M;
var Y02 >=   0.0 <= 10^M;
var Y03 >=   0.0 <= 10^M;
var Y04 >=  20.0 <= 10^M;
var Y05 >=  80.0 <= 10^M;
var Y06 >=  95.0 <= 10^M;
var Y07 >=   0.0 <= 10^M;
var Y08 >=   0.0 <= 10^M;
var Y09 >=   0.0 <= 10^M;
var Y10 >=   0.0 <= 10^M;
var Y11 >=  50.0 <= 10^M;
var Y12 >=  60.0 <= 10^M;


// ПЕНИРАНИ ПАМУЧНИ ПРЕЖДИ ЗА РЕАЛИЗАЦИЯ
var Y13 >=  60.0 <= 10^M;
var Y14 >=  55.0 <= 10^M;
var Y15 >=  90.0 <= 10^M;
var Y16 >=  20.0 <= 10^M;
var Y17 >=  30.0 <= 10^M;
var Y18 >=   9.0 <= 10^M;
var Y19 >=  50.0 <= 10^M;
var Y20 >=  65.0 <= 10^M;
var Y21 >=  30.0 <= 10^M;
var Y22 >=  45.0 <= 10^M;
var Y23 >=  36.0 <= 10^M;


// ПРЕЖДИ СМЕС (ПАМУК И ПОЛИЕСТЕР) ЗА РЕАЛИЗАЦИЯ
var Y24 >=   0.0 <= 10^M;
var Y25 >=  10.0 <= 10^M;
var Y26 >=  15.0 <= 10^M;
var Y27 >= 120.0 <= 10^M;
var Y28 >= 180.0 <= 10^M;
var Y29 >=  10.0 <= 10^M;
var Y30 >=   0.0 <= 10^M;
var Y31 >= 100.0 <= 10^M;
var Y32 >= 110.0 <= 10^M;


// КОЛИЧЕСТВАТА ОТПАДЪЦИ ПО ВИДОВЕ
var R01 >= 115.0 <= 385.0;
var R02 >= 150.0 <= 185.0;
var R03 >=   0.0 <=  13.0;
var R04 >=  85.0 <=  92.0;
var R05 >=  70.0 <=  73.0;
var R06 >=   0.0 <=   5.0;


// КОЛИЧЕСТВАТА ВХОДНИ СУРОВИНИ
var COTTON01 >= 1065.0 <= 10^N;
var COTTON04 >= 2415.0 <= 10^N;
var COTTON05 >=  231.0 <= 10^N;
var POLYESTR >= 1594.0 <= 10^N;

/*
Максимизация на общия обем промишлена продукция (в случая прежди) в натурално изражение (Т.).
*/
maximize obem:
X01 + X02 + X03 + X04 + X05 + X06 + X07 + X08 + X09 + X10 + X11 + X12 + X13 + X14 + X15 + X16 + X17 + X18 + X19 + X20 +
X21 + X22 + X23 + X24 + X25 + X26 + X27 + X28 + X29 + X30 + X31 + X32 + X33 + X34 + X35 + X36 + X37 + X38 + X39 + X40 +
X41 + Y01 + Y02 + Y03 + Y04 + Y05 + Y06 + Y07 + Y08 + Y09 + Y10 + Y11 + Y12 + Y13 + Y14 + Y15 + Y16 + Y17 + Y18 + Y19 +
Y20 + Y21 + Y22 + Y23 + Y24 + Y25 + Y26 + Y27 + Y28 + Y29 + Y30 + Y31 + Y32;

/*
Минимизация на себестойността на продукцията в стойностно изражение (лв.).
*/
minimize sebst: 
4.0550*X01 + 3.8700*X02 + 4.1530*X03 + 5.3320*X04 + 3.3630*X05 + 3.7660*X06 + 4.0910*X07 + 4.0000*X08 + 4.1020*X09 + 0.0000*X10 +
0.0000*X11 + 0.0000*X12 + 0.0000*X13 + 0.0000*X14 + 0.0000*X15 + 5.7740*X16 + 5.7540*X17 + 6.4170*X18 + 7.1840*X19 + 6.4240*X20 +
5.9940*X21 + 5.0920*X22 + 6.7890*X23 + 4.7770*X24 + 4.6420*X25 + 4.8520*X26 + 5.9810*X27 + 4.2390*X28 + 6.1120*X29 + 4.5820*X30 +
4.8240*X31 + 5.5450*X32 + 4.8230*X33 + 4.8610*X34 + 5.0600*X35 + 4.9850*X36 + 6.0380*X37 + 5.6820*X38 + 0.0000*X39 + 6.7890*X40 +
5.5980*X41 + 3.1490*Y01 + 3.8160*Y02 + 3.7660*Y03 + 5.5290*Y04 + 3.6160*Y05 + 4.8020*Y06 + 0.0000*Y07 + 3.7360*Y08 + 5.8180*Y09 +
5.6440*Y10 + 4.6790*Y11 + 5.3000*Y12 + 4.8660*Y13 + 6.1100*Y14 + 6.0070*Y15 + 5.0420*Y16 + 5.5560*Y17 + 5.3520*Y18 + 5.1000*Y19 +
6.4870*Y20 + 5.1150*Y21 + 5.6460*Y22 + 6.0430*Y23 + 3.8350*Y24 + 4.4470*Y25 + 4.6130*Y26 + 4.4770*Y27 + 5.7650*Y28 + 4.7010*Y29 +
4.5640*Y30 + 4.8500*Y31 + 4.8650*Y32;
 
/*
Максимизация на сумарната печалба от всички изходни продукти в стойностно изражение (лв.).
*/
maximize pechalba:
0.1550*X01 + 0.1800*X02 + 0.2370*X03 + 0.2080*X04 + 0.8470*X05 + 0.2840*X06 + 0.2990*X07 + 0.0300*X08 - 0.0720*X09 + 0.0000*X10 +
0.0000*X11 + 0.0000*X12 + 0.0000*X13 + 0.0000*X14 + 0.0000*X15 + 0.3660*X16 + 0.3860*X17 + 0.5030*X18 + 1.2660*X19 + 0.4960*X20 +
1.0260*X21 + 0.7080*X22 + 1.2410*X23 + 0.0990*X24 + 0.8180*X25 + 0.7980*X26 + 1.0890*X27 + 0.6210*X28 + 0.8780*X29 + 0.8780*X30 +
0.0520*X31 + 0.9450*X32 + 0.8270*X33 + 0.9990*X34 + 0.8400*X35 + 0.9150*X36 - 0.0080*X37 - 0.0320*X38 + 0.0000*X39 + 1.2410*X40 +
0.1820*X41 + 0.3310*Y01 - 0.2960*Y02 + 0.2840*Y03 - 0.5390*Y04 + 0.7740*Y05 - 0.4120*Y06 + 0.0000*Y07 + 0.7640*Y08 - 0.5480*Y09 +
0.1460*Y10 - 0.9290*Y11 - 0.9500*Y12 + 0.3040*Y13 - 0.4900*Y14 - 0.7170*Y15 + 0.3480*Y16 + 0.3640*Y17 - 0.0820*Y18 + 0.3600*Y19 -
0.4270*Y20 + 0.3950*Y21 + 0.7340*Y22 + 0.2270*Y23 + 1.0250*Y24 + 0.4130*Y25 + 0.8470*Y26 + 0.5730*Y27 - 0.1150*Y28 + 1.0790*Y29 +
0.8360*Y30 + 0.2000*Y31 + 0.2850*Y32 + 1.2000*R01 + 0.0300*R02 + 0.0300*R03 + 0.4000*R04 + 0.7000*R05 + 0.7000*R06;

/*
Минимизация на количествата входни суровини, използвани в производството, изразено в натурални единици (Т.).
*/
minimize vhsurov: COTTON01 + COTTON04 + COTTON05 + POLYESTR;

/************************************************************ Ограничения *********************************************************/

/*
ПЪРВА ГРУПА ОГРАНИЧЕНИЯ по фонд машинно време на лимитиращи производствени машини.

Ограниченията, отразяват изискването необходимият фонд машинно време за съответната група
машини да не превишава наличния фонд за плановия период. Отнасят се за групите машини,
произвеждащи полуфабрикати и готова продукция. Представляват неравенства от тип "по-малко или равно"
и броят им е равен на съответните лимитиращи групи машини.
*/


// ФОНД МАШИННО ВРЕМЕ НА РЕШЕЩИ-ГРЕБЕННИ МАШИНИ
resheshtiGrebenni:
0.0221*X10 + 0.0735*X11 + 0.0735*X12 + 0.0735*X13 + 0.0735*X14 + 0.0735*X15 + 0.0735*X16 + 0.0735*X17 + 0.0735*X18 +
0.0735*X19 + 0.0735*X20 + 0.0243*X21 + 0.0243*X22 + 0.0243*X23 + 0.0243*X24 + 0.0243*X25 + 0.0243*X26 + 0.0243*X27 +
0.0243*X28 + 0.0243*X29 + 0.0243*X30 + 0.0243*X31 + 0.0243*X32 + 0.0243*X33 + 0.0243*X34 + 0.0243*X35 + 0.0243*X36 +
0.0368*X39 + 0.0368*X40 + 0.0368*X41 + 0.0221*Y11 + 0.0221*Y12 + 0.0735*Y13 + 0.0735*Y14 + 0.0735*Y15 + 0.0735*Y16 +
0.0735*Y17 + 0.0735*Y18 + 0.0735*Y19 + 0.0735*Y20 + 0.0735*Y21 + 0.0735*Y22 + 0.0735*Y23 + 0.0243*Y24 + 0.0243*Y25 +
0.0243*Y26 + 0.0243*Y27 + 0.0243*Y28 + 0.0243*Y29 + 0.0243*Y30 + 0.0368*Y31 + 0.0368*Y32 <= 152.49;


// ФОНД МАШИННО ВРЕМЕ НА СМЕСИТЕЛНО-ИЗТЕГЛИТЕЛНИ МАШИНИ
smesitelnoIzteglitelni:
0.0125*X01 + 0.0125*X02 + 0.0125*X03 + 0.0125*X04 + 0.0125*X05 + 0.0125*X06 + 0.0125*X07 + 0.0165*X08 + 0.0165*X09 +
0.0165*X10 + 0.0165*X11 + 0.0165*X12 + 0.0165*X13 + 0.0165*X14 + 0.0165*X15 + 0.0165*X16 + 0.0165*X17 + 0.0165*X18 +
0.0165*X19 + 0.0165*X20 + 0.0189*X21 + 0.0189*X22 + 0.0189*X23 + 0.0189*X24 + 0.0189*X25 + 0.0189*X26 + 0.0189*X27 + 
0.0189*X28 + 0.0189*X29 + 0.0189*X30 + 0.0189*X31 + 0.0189*X32 + 0.0189*X33 + 0.0189*X34 + 0.0189*X35 + 0.0189*X36 + 
0.0191*X37 + 0.0191*X38 + 0.0189*X39 + 0.0189*X40 + 0.0189*X41 + 0.0165*Y01 + 0.0165*Y02 + 0.0165*Y03 + 0.0125*Y04 + 
0.0165*Y05 + 0.0165*Y06 + 0.0165*Y07 + 0.0165*Y08 + 0.0165*Y09 + 0.0165*Y10 + 0.0165*Y11 + 0.0165*Y12 + 0.0165*Y13 + 
0.0165*Y14 + 0.0165*Y15 + 0.0165*Y16 + 0.0165*Y17 + 0.0165*Y18 + 0.0165*Y19 + 0.0165*Y20 + 0.0165*Y21 + 0.0165*Y22 + 
0.0165*Y23 + 0.0189*Y24 + 0.0189*Y25 + 0.0189*Y26 + 0.0189*Y27 + 0.0189*Y28 + 0.0189*Y29 + 0.0189*Y30 + 0.0189*Y31 + 
0.0189*Y32 <= 102.063;


// ФОНД МАШИННО ВРЕМЕ НА "TRUCHLER" МАШИНИ
truchler:
0.0333*X01 + 0.0333*X02 + 0.0333*X03 + 0.0333*X04 + 0.0333*X05 + 0.0333*X06 + 0.0333*X07 + 0.0333*Y08 + 0.0333*X37 +
0.0333*X38 <= 121.680;


// ФОНД МАШИННО ВРЕМЕ НА РАЗТВОРИТЕЛНО-БИЕЩИ МАШИНИ (БАТАЖИ)
bataji:
0.0068*X08 + 0.0068*X09 + 0.0068*X10 + 0.0068*X11 + 0.0068*X12 + 0.0068*X13 + 0.0068*X14 + 0.0068*X15 + 0.0068*X16 +
0.0068*X17 + 0.0068*X18 + 0.0068*X19 + 0.0068*X20 + 0.0068*X21 + 0.0068*X22 + 0.0068*X23 + 0.0068*X24 + 0.0068*X25 +
0.0068*X26 + 0.0068*X27 + 0.0068*X28 + 0.0068*X29 + 0.0068*X30 + 0.0068*X31 + 0.0068*X32 + 0.0068*X33 + 0.0068*X34 +
0.0068*X35 + 0.0068*X36 + 0.0068*X39 + 0.0068*X40 + 0.0068*X41 + 0.0068*Y01 + 0.0068*Y02 + 0.0068*Y03 + 0.0068*Y05 +
0.0068*Y06 + 0.0068*Y07 + 0.0068*Y08 + 0.0068*Y09 + 0.0068*Y10 + 0.0068*Y11 + 0.0068*Y12 + 0.0068*Y13 + 0.0068*Y14 +
0.0068*Y15 + 0.0068*Y16 + 0.0068*Y17 + 0.0068*Y18 + 0.0068*Y19 + 0.0068*Y20 + 0.0068*Y21 + 0.0068*Y22 + 0.0068*Y23 +
0.0068*Y24 + 0.0068*Y25 + 0.0068*Y26 + 0.0068*Y27 + 0.0068*Y28 + 0.0068*Y29 + 0.0068*Y30 + 0.0068*Y31 + 0.0068*Y32 <= 30.345;


// ФОНД МАШИННО ВРЕМЕ НА ДАРАЦИТЕ
daraci:
0.1000*X08 + 0.1000*X09 + 0.1000*X10 + 0.1000*X11 + 0.1000*X12 + 0.1000*X13 + 0.1000*X14 + 0.1000*X15 + 0.1000*X16 +
0.1000*X17 + 0.1000*X18 + 0.1000*X19 + 0.1000*X20 + 0.0874*X21 + 0.0874*X22 + 0.0874*X23 + 0.0874*X24 + 0.0874*X25 +
0.0874*X26 + 0.0874*X27 + 0.0874*X28 + 0.0874*X29 + 0.0874*X30 + 0.0874*X31 + 0.0874*X32 + 0.0874*X33 + 0.0874*X34 +
0.0874*X35 + 0.0874*X36 + 0.0906*X39 + 0.0906*X40 + 0.0906*X41 + 0.1000*Y01 + 0.1000*Y02 + 0.1000*Y03 + 0.1000*Y05 +
0.1000*Y06 + 0.1000*Y07 + 0.1000*Y08 + 0.1000*Y09 + 0.1000*Y10 + 0.1000*Y11 + 0.1000*Y12 + 0.1000*Y13 + 0.1000*Y14 +
0.1000*Y15 + 0.1000*Y16 + 0.1000*Y17 + 0.1000*Y18 + 0.1000*Y19 + 0.1000*Y20 + 0.1000*Y21 + 0.1000*Y22 + 0.1000*Y23 +
0.0874*Y24 + 0.0874*Y25 + 0.0874*Y26 + 0.0874*Y27 + 0.0874*Y28 + 0.0874*Y29 + 0.0874*Y30 + 0.0906*Y31 + 0.0906*Y32 <= 277.440;


/*
ВТОРА ГРУПА ОГРАНИЧЕНИЯ по количество суровини, необходими за производството на готовата продукция.

Представляват неравенства от тип "по-малко или равно" и броят им е равен на броя суровините (COTTONk, POLYESTR).
Отразяват условието сумарното количество от дадена входна суровина във всички видове продукция, т.е. Xi или YI,
в който тя участва да е по-малко или равно от общото количество COTTONk или POLYESTR.
*/


// КОЛИЧЕСТВО ПАМУК (COTTON 01) ВЪВ ВСИЧКИ ГРУПИ ИЗХОДНА ПРОДУКЦИЯ
cotton01Quantity:
1.0800*X01 + 1.0800*X02 + 1.0800*X03 + 1.0800*X04 + 1.0800*X05 + 1.0800*X06 + 1.0800*X07 + 1.0800*X08 + 1.0800*X09 +
1.0800*Y01 + 1.0800*Y02 + 1.0800*Y03 + 1.0800*Y04 + 1.0800*Y05 + 1.0800*Y06 + 1.0800*Y07 + 0.7595*Y08 + 0.7595*Y09 +
0.7595*Y10 - COTTON01 <= 0.0;


// КОЛИЧЕСТВО ПАМУК (COTTON 04) ВЪВ ВСИЧКИ ГРУПИ ИЗХОДНА ПРОДУКЦИЯ
cotton04Quantity:
1.0730*X10 + 1.2800*X11 + 1.2800*X12 + 1.2800*X13 + 1.2800*X14 + 1.2800*X15 + 1.2800*X16 + 1.2800*X17 + 0.3722*X21 +
0.3722*X22 + 0.3722*X23 + 0.3722*X24 + 0.3722*X25 + 0.3722*X26 + 0.3722*X27 + 0.3722*X28 + 0.3722*X29 + 0.3722*X30 +
0.3722*X31 + 0.3722*X32 + 0.3722*X33 + 0.3722*X34 + 0.5950*X37 + 0.3255*Y08 + 0.3255*Y09 + 0.3255*Y10 + 1.0730*Y11 +
1.0730*Y12 + 1.2800*Y13 + 1.2800*Y14 + 1.2800*Y15 + 1.2800*Y16 + 1.2800*Y17 + 1.2800*Y18 + 1.2800*Y19 + 1.2800*Y20 +
1.2800*Y21 + 1.2800*Y22 + 0.3722*Y24 + 0.3722*Y25 + 0.3722*Y26 + 0.3722*Y27 + 0.3722*Y28 + 0.3722*Y29 + 0.3722*Y30 -
COTTON04 <= 0.0;


// КОЛИЧЕСТВО ПАМУК (COTTON 05) ВЪВ ВСИЧКИ ГРУПИ ИЗХОДНА ПРОДУКЦИЯ
cotton05Quantity:
1.3120*X18 + 1.3120*X19 + 1.3120*X20 + 0.3765*X35 + 0.3765*X36 + 0.5755*X38 + 0.5755*X39 + 0.5755*X40 + 0.5755*X41 +
1.3120*Y23 + 0.5755*Y31 + 0.5755*Y32 - COTTON05 <= 0.0;


// КОЛИЧЕСТВО ПОЛИЕСТЕР (POLYESTR) ВЪВ ВСИЧКИ ГРУПИ ИЗХОДНА ПРОДУКЦИЯ
polyestrQuantity:
0.7558*X21 + 0.7558*X22 + 0.7558*X23 + 0.7558*X24 + 0.7558*X25 + 0.7558*X26 + 0.7558*X27 + 0.7558*X28 + 0.7558*X29 +
0.7558*X30 + 0.7558*X31 + 0.7558*X32 + 0.7558*X33 + 0.7558*X34 + 0.7645*X35 + 0.7645*X36 + 0.5950*X37 + 0.5755*X38 +
0.5755*X39 + 0.5755*X40 + 0.5755*X41 + 0.7558*Y24 + 0.7558*Y25 + 0.7558*Y26 + 0.7558*Y27 + 0.7558*Y28 + 0.7558*Y29 +
0.7558*Y30 + 0.5755*Y31 + 0.5755*Y32 - POLYESTR <= 0.0;

/*
ТРЕТА ГРУПА ОГРАНИЧЕНИЯ представляват горни граници на различните групи прежди.

Ограниченията представляват неравенства от тип "по-малко или равно" и броят им е равен на броя групи на които се разделя
най-общо продукцията. Ограниченията отразяват условията сумарното количество изходни продукти (променливите Xi и Yi)
по групи да не надвишава технологичната граница. Технологичната граница гарантира безпрепятсвено преминаването на получените
потоци прежди Xi и Yi през всички групи машини.
*/



// ГРУПОВА ГОРНА ГРАНИЦА-КАРДНИ ПАМУЧНИ ПРЕЖДИ
kardniPamuchniPrejdi:
X01 + X02 + X03 + X04 + X05 + X06 + X07 + X08 + X09 + X10 + Y01 + Y02 + Y03 + Y04 + Y05 + Y06 + Y07 + Y08 + Y09 + Y10 +
Y11 + Y12 <= 1371;


// ГРУПОВА ГОРНА ГРАНИЦА - ПЕНИРАНИ ПАМУЧНИ ПРЕЖДИ
peniraniPamuchniPrejdi:
X11 + X12 + X13 + X14 + X15 + X16 + X17 + X18 + X19 + X20 + Y13 + Y14 + Y15 + Y16 + Y17 + Y18 + Y19 + Y20 + Y21 + Y22 + 
Y23 <= 877;


// ГРУПОВА ГОРНА ГРАНИЦА ПРЕЖДИ СМЕС (ПАМУК И ПОЛИЕСТЕР)
prejdiSmes:
X21 + X22 + X23 + X24 + X25 + X26 + X27 + X28 + X29 + X30 + X31 + X32 + X33 + X34 + X35 + X36 + X37 + X38 + X39 + X40 + 
X41 + Y24 + Y25 + Y26 + Y27 + Y28 + Y29 + Y30 + Y31 + Y32 <= 2867;


/*
ЧЕТВЪРТА ГРУПА ОГРАНИЧЕНИЯ по долни граници на двойки променливи Yi (прежди за реализация). 

Ограниченията са наложени от спецификата на изходната продукция, тъй като някой променливи Yi представляват
една и съща прежда, но в някой случаи тя се реализира навита на шпули, а в други след допълнителна обработка на бобини.
Това означава разлика в себестойностите и цените им, но по-съществено това е един вид прежда, за която е получена обща
заявка. Тази заявка е именно долна граница по двойка променливи Yi. Ограниченията са неравенства от вида
"по-голямо или равно" и броят им е равен на броя на двойките променливи Yi.
*/


// ДОЛНИ ГРАНИЦИ ПО ДВОЙКИ ПРЕЖДИ
dd1: Y05 + Y06 >= 365.0;
dd2: Y11 + Y12 >= 172.0;
dd3: Y13 + Y14 >= 166.0;
dd4: Y16 + Y17 >=  64.0;
dd5: Y19 + Y20 >= 130.0;
dd6: Y21 + Y22 >=  96.0;
dd7: Y25 + Y26 >=  38.0;
dd8: Y27 + Y28 >= 414.0;
